{"class_name": "Model", "config": {"name": "model_10", "layers": [{"name": "input_10", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "sparse": false, "name": "input_10"}, "inbound_nodes": []}, {"name": "embedding_4", "class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, 21], "dtype": "float32", "input_dim": 199, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 21}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "lstm_4", "class_name": "LSTM", "config": {"name": "lstm_4", "trainable": true, "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "implementation": 1}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}, {"name": "lstm_5", "class_name": "LSTM", "config": {"name": "lstm_5", "trainable": true, "return_sequences": false, "return_state": true, "go_backwards": true, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "implementation": 1}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}, {"name": "concatenate_6", "class_name": "Concatenate", "config": {"name": "concatenate_6", "trainable": true, "axis": -1}, "inbound_nodes": [[["lstm_4", 0, 0, {}], ["lstm_5", 0, 0, {}]]]}, {"name": "repeat_vector_4", "class_name": "RepeatVector", "config": {"name": "repeat_vector_4", "trainable": true, "n": 21}, "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "inbound_nodes": [[["lstm_4", 0, 1, {}], ["lstm_5", 0, 1, {}]]]}, {"name": "concatenate_5", "class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "axis": -1}, "inbound_nodes": [[["lstm_4", 0, 2, {}], ["lstm_5", 0, 2, {}]]]}, {"name": "lstm_6", "class_name": "LSTM", "config": {"name": "lstm_6", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["repeat_vector_4", 0, 0, {}], ["concatenate_4", 0, 0, {}], ["concatenate_5", 0, 0, {}]]]}, {"name": "time_distributed_10", "class_name": "TimeDistributed", "config": {"name": "time_distributed_10", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "units": 344, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["lstm_6", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["time_distributed_10", 0, 0, {}]]]}], "input_layers": [["input_10", 0, 0]], "output_layers": [["activation_10", 0, 0]]}, "keras_version": "2.0.9", "backend": "tensorflow"}